<template>
    <v-layout wrap >
        <v-flex md12>
            <p class="page-title">随便推荐</p>
        </v-flex>
        <v-flex xs6 sm4 md2 v-for="(book,idx) in recommend_books" :key="'rec'+idx+book.id" class="book-card">
            <v-card flat :href="book.href" >
                <v-img :src="book.img" height="240px" contain > </v-img>
            </v-card>
        </v-flex>

        <v-flex xs12 >
            <v-divider class="new-legend"></v-divider>
            <p class="page-title">新书推荐-{{$vuetify.breakpoint.name}}</p>
        </v-flex>
        <v-flex>
            <book-cards :books="new_books"></book-cards>
        </v-flex>
    </v-layout>
</template>

<script>
import BookCards from "../components/BookCards.vue";
export default {
    components: {
        BookCards,
    },
    computed: {
        recommend_books: function() {
            var cdn = this.rsp.cdn_domain;
            var cdn_domain = cdn ? ("//"+cdn) : "/";
            return this.rsp.recommends.map( b => {
                b['href'] = "/book/" + b.id;
                b['img'] = cdn_domain + "/get/cover/"+b.id+".jpg";
                return b;
            });
        },
        new_books: function() {
            var cdn = this.rsp.cdn_domain;
            var cdn_domain = cdn ? ("//"+cdn) : "/";
            return this.rsp.news.map( b => {
                b['href'] = "/book/" + b.id;
                b['img'] = cdn_domain + "/get/cover/"+b.id+".jpg";
                return b;
            });
        },
    },
    data: () => ({
        url: "https://www.talebook.org/search?fmt=json&from=weixin&name=%E6%B5%AE%E7%94%9F%E5%85%AD%E8%AE%B0",
            rsp: {
            "cdn_domain": "js.talebook.org",
            'news': [
                {'title': '13030172-《云中歌2：浮生梦[精品]》', 'id': 16788, 'comments': null},
                {'title': '素履之往', 'id': 15906, 'comments': '项脊浮生'},
                {'title': '浮生梦(《蝴蝶梦》作者感动全球亿万读者的炽热初恋故事。中国读者错过了65年的爱情经典。) (读客全球顶级畅销小说文库 227)', 'id': 14701, 'comments': null},
                {'title': '算来一梦浮生：南唐后主李煜的词话人生', 'id': 14637, 'comments': null},
                {'title': '浮生三记', 'id': 13746, 'comments': null},
                {'title': '岁月静好现世安稳', 'id': 8545, 'comments': '《岁月静好 现世安稳》是2012年中国华侨出版社出版的图书，作者是白落梅。主要讲述了俯瞰烟火人间，品静好人生，盼现世安稳的故事。继《你若安好 便是晴天》之后，《岁月静好 现世安稳》对众人又一深深的祝福，是延续《因为懂得 所以慈悲》中对张爱玲的敬意，带领我们一起追逐张爱玲曾向往的生活。一剪闲云一溪月，一程山水一年华。一世浮生一刹那，一树菩提一烟霞。'},
                {'title': '浮生梦（耽美小说）', 'id': 7802, 'comments': '《浮生梦》是尘印创作的耽美类网络小说，包括七部正剧，每部剧相互关联。'},
                {'title': '三生三世十里桃花', 'id': 8864, 'comments': '那一世，大荒之中一处荒山，成就她与他的初见。\n桃花灼灼，枝叶蓁蓁，妖娆伤眼。\n记忆可以封存，可心有时也会背叛，忘得了前世情缘，忘不了桃林十里，亦忘不了十里桃林中玄衣的少年。\n这一世，东海水晶宫，他们不期而遇。\n不是每个人都能看透这三生三世的爱恨交织，只要你还在，只要我还爱，那么，这世间，刀山火海，毫不畏惧。\n有些爱，藏在嘴边，挂在心尖。 浮生若梦，情如流水，爱似桃花……'},
                {'title': '陈二狗的妖孽人生（续集）', 'id': 7031, 'comments': '关于作者有两种说法1、蚂蚁望月 2、烽火戏诸侯\n 不管谁写的，这本书的续写的非常合理。将《二狗》中烽火挖的坑的全部填上，并且十分合理。\n \n  \n“其爷如老龟，其父如瘦虎，其兄如饥鹰。”“你知道这句话的意思到底是什么吗？”陈浮生摇头，这句话他只是听王虎剩说过还真没往心里去，他一直以为那是王虎剩随口胡诌的。王玄策叹口气，“你们陈家当初只剩下四个男人。其爷如老龟，其父如瘦虎，其兄如饥鹰，就是玄武，白虎，朱雀。”“三元聚首出青龙。”\n其爷如老龟，其父如瘦虎，其兄如饥鹰，三元聚首出青龙。\n这便是这本书的二狗。'},
/*
{'title': '皂香之尘世浮生', 'id': 11779, 'comments': null},
{'title': '浮生物语', 'id': 9685, 'comments': '千百年前，她曾是爱上了水神的小小树妖，在经历过与水神幻灭的悲情爱恋后，她独自活到现世，变成了“不停”甜品店的老板娘。\n    她会泡一种叫做浮生的茶，她店铺里会来很多奇怪的客人。\n    每个客人都会喝到她的茶，给她说一个自己的故事，那是妖怪们荡气回肠的爱恨情仇——俊美的猫妖少年爱上一条鱼、视觉系的美艳狐狸守护着谶花、黄金狮子仰天长啸拯救爱人，夜蝶武士背负离奇身世诛杀妖魔……\n    每个光临甜品店的客人身上都有故事。如同浮生茶一般，有着百转千回后的苦涩与甘甜？\n    树妖老板娘是听故事的人。而她自己也是在人生中淡然寻觅的人她的生命有子淼、九厥、敖炽、胖子、瘦子……\n    最终，他们将走向何方？'},
{'title': '古文观止译注', 'id': 7367, 'comments': '项脊浮生'},
{'title': '《陈二狗的妖孽人生》', 'id': 5675, 'comments': '衣衫褴褛的老人蹲坐在破败房子前的白桦木墩子上，喝一口自制的烧酒，抽一口极烈的青蛤蟆旱烟，眯起眼睛，望着即将落入长白山脉的夕阳，朝身旁一个约莫六七岁、正陪着一黑一白两头土狗玩耍的小孩子说道：“浮生，最让东北虎忌惮的畜生，不是皮糙肉厚的黑瞎子，也不是600斤的野猪王，而是上了山的守山犬。”\n\n\u3000\u3000许多年后，老人躺进了一座不起眼的坟包，那个没被大雪天刮烟炮冻死、没被张家寨村民戳脊梁骨白眼死的孩子终于走出大山，来到城市，像一条进了山的疯狗，咬过跪过低头过，所以荣耀。\n\n\u3000\u3000其爷如老龟，死于无名。其兄如饥鹰，搏击北方。其父如瘦虎，东临碣石。\n\n\u3000\u3000那绰号陈二狗的他，能否打拼出一世荣华？'},
{'title': '浮生六记', 'id': 5394, 'comments': '并不能用有趣、精致、伤感简单概括这本小书。之所以入得经典行列，约是手边有此一册，便真如有一妙友相伴。\n本次出版选开明书店民国本为底本，考以《雁来红丛报》本、霜枫社民国本、林语堂英译本重新点校；并请张佳玮精心译述，作长文译记为读者导读。原文、译文并收一本。\n独家收录“沈复的一生”（年表）“沈复三十年游历图”，另附“光绪三年初版序”“潘麐生题记”“光绪三年初版跋”，便于读者朋友更好读懂这本书，从中获益。\n沈复，字三白，号梅逸。清乾隆二十八年（1763年）生于姑苏城南沧浪亭畔士族文人之家，十八岁娶舅女陈芸为妻。婚后夫妻俩举案齐眉、相爱甚笃，然命途多舛，常常事与愿违；幸而二人不落世俗，善苦中作乐，耳鬓厮磨二十三年，至芸积病身故，仍情深如旧。后，沈复离家漫游，著《浮生六记》六卷。成书后并未刊行出版，而在民间多有传抄，引以为珍。道光年间，由江南士人杨引传于街市书摊购得，转妹婿王韬于申报馆付梓出版。因其中以真言述真情，从不刻意造作，深为后世文人所推崇，流传至今，已成经典。其中《中山记历》《养生记道》两记，杨引传购得版本已佚。民国时期有称找到足本，并付梓出版，收录佚失两记，然实为时人拼凑杜撰。后常有传言佚记真本现身，或有相关、或片段，但至今仍无被证实可靠完整的，故本版只收底本所录《闺房记乐》《闲情记趣》《坎坷记愁》《浪游记快》四记。\n俞平伯：“《浮生六记》俨如一块纯美的水晶，只见明莹，不见衬露明莹的颜色；只见精微，不见制作精微的痕迹。然而我自信这种说法不至于是溢美。想读这书的，必有能辨别的罢。”\n林语堂：“我相信淳朴恬适自甘的生活——如芸所说“布衣菜饭，可乐终身”的生活，是宇宙间最美丽的东西。在我翻阅重读这本小册之时，每每不期然而然想到这安乐的问题——读了沈复的书每使我感到这安乐的奥妙，远超乎尘俗之压迫与人身之痛苦。”'},
{'title': '算来一梦浮生', 'id': 4690, 'comments': '江南的山山水水，春光秋色里，他用最真实的自己，抒写了一段最感人至深、亦是最怅然的故事。\n他是文人、是君主、也是降君。后人的纸笔中总有他俊朗洒脱的身影，也有他坎坷波折的一生；有他的疏狂，亦有他的忧伤和绝望……\n但他总还是他吧。在历史的某一个角落里，用他特有的光晕，驱开四周的黑暗，让我们望到了昏黄月光下，那个“待踏马蹄清夜月”的他，那个“无言独上西楼”的他……\n算来一梦浮生，他的人生早已走完，但是千百年来，我们却还有无数的人，流连在他不一般的人生故事中……'},
{'title': '小麦的小人书', 'id': 5305, 'comments': '《小麦的小人书》是一本既有趣味，又有品质的书。小人书，就是上世纪八十年代中期以前风行中国大地几十年，为广大群众喜闻乐见，雅俗共赏的连环画。作者以连环画为支点，选择不同的剖面切入，深致浅出，融艺术鉴赏、人生体悟和情感想象于一炉。作者文笔独特，既典雅蕴藉、又俏皮灵动，亦庄亦谐，张弛有道，显示出深厚的文字功力。这个总题为《浮生旧梦说连环》的系列散文2008-2009年陆续在《天涯》、《文学自由谈》、《美文》、《人民文学》、《读库》等刊物以集中或连载形式发表，备受关注，好评如潮。文章分为六辑：“山乡”、“打仗”、“贺家班”、“好姻缘”、“古装”、“隋唐”，并配有相应的连环画，文图相得益彰。集结成一《小麦的小人书》，不同读者的阅读期待、审美需求、怀旧心理、收藏品味都将得到满足，它是一本不可多得的好书。'},
{'title': '乡关何处', 'id': 3791, 'comments': '《乡关何处:故乡•故人•故事》内容简介：感知故乡、故人、故事中的深沉情感。《乡关何处:故乡•故人•故事》所收录的文章中，母亲历尽人生苦难68岁失踪于长江（江上的母亲）；外婆出身高贵，慈悲温暖，却一生遭遇悲惨（坟灯）；大伯少年英姿勃发才华横溢投身革命，爱情也随之而来，但谁知阴差阳错，最终凄凉落寞孤独走完一生（大伯的革命与爱情）……在《乡关何处》中，这等亲朋好友，仿佛就这么站在你的面前，将他们的故事幽幽道来。在野夫的笔下，除了能读到他们个人或悲惨或传奇的经历，还能看到这几十年来大背景下的变革与变迁。《乡关何处》是作者野夫泣血的挽歌，至情至亲至哀，长久积累下的压抑的悲恸比爆发更有力量。\n野夫如此解释《乡关何处:故乡•故人•故事》的乡愁：许多年来，我问过无数人的故乡何在，大多都不知所云。故乡于很多人来说，是必须要扔掉的裹脚布；仿佛不遗忘，他们便难以飞得更高走得更远。而我，若干年来却像一个遗老，总是沉浸在往事的泥淖中，在诗酒猖狂之余，常常失魂落魄地站成了一段乡愁。\n思享家系列丛书：\n半生为人\n问道者\n旧山河\n价值的理由   海报：'},
{'title': '脂砚斋重批红楼梦', 'id': 3405, 'comments': '脂砚斋重评石头记 \u3000\u3000本书是甲戌《红楼梦》的校订本。 本书可以从中窥见曹雪芹生前创作这部小说的早期原貌，并可直接品味到作者的“红颜知己”脂砚斋在甲戌原稿本上留下的1600余条珍贵批语。这是打开《红楼梦》迷宫的一把钥匙！ 本书所据底本，是目前发现的11种《红楼梦》指评本中产生年代最早、保存原貌最真切、残缺也较多、但却是最珍贵的一年，由胡适先生1927年发现收藏，现藏美国康奈尔大学图书馆。今据1961年台湾首次面市的影印本校点排印，并悉数收录了原底本及影印本上有关此本的各种资料。 '},
{'title': '乡关何处', 'id': 2066, 'comments': '《乡关何处:故乡•故人•故事》内容简介：感知故乡、故人、故事中的深沉情感。《乡关何处:故乡•故人•故事》所收录的文章中，母亲历尽人生苦难68岁失踪于长江（江上的母亲）；外婆出身高贵，慈悲温暖，却一生遭遇悲惨（坟灯）；大伯少年英姿勃发才华横溢投身革命，爱情也随之而来，但谁知阴差阳错，最终凄凉落寞孤独走完一生（大伯的革命与爱情）……在《乡关何处》中，这等亲朋好友，仿佛就这么站在你的面前，将他们的故事幽幽道来。在野夫的笔下，除了能读到他们个人或悲惨或传奇的经历，还能看到这几十年来大背景下的变革与变迁。《乡关何处》是作者野夫泣血的挽歌，至情至亲至哀，长久积累下的压抑的悲恸比爆发更有力量。\n野夫如此解释《乡关何处:故乡•故人•故事》的乡愁：许多年来，我问过无数人的故乡何在，大多都不知所云。故乡于很多人来说，是必须要扔掉的裹脚布；仿佛不遗忘，他们便难以飞得更高走得更远。而我，若干年来却像一个遗老，总是沉浸在往事的泥淖中，在诗酒猖狂之余，常常失魂落魄地站成了一段乡愁。\n思享家系列丛书：\n半生为人\n问道者\n旧山河\n价值的理由   海报：'}
*/
            ],
            'recommends': [
                {'title': '皂香之尘世浮生', 'id': 11779, 'comments': null},
                {'title': '浮生物语', 'id': 9685, 'comments': '千百年前，她曾是爱上了水神的小小树妖，在经历过与水神幻灭的悲情爱恋后，她独自活到现世，变成了“不停”甜品店的老板娘。\n    她会泡一种叫做浮生的茶，她店铺里会来很多奇怪的客人。\n    每个客人都会喝到她的茶，给她说一个自己的故事，那是妖怪们荡气回肠的爱恨情仇——俊美的猫妖少年爱上一条鱼、视觉系的美艳狐狸守护着谶花、黄金狮子仰天长啸拯救爱人，夜蝶武士背负离奇身世诛杀妖魔……\n    每个光临甜品店的客人身上都有故事。如同浮生茶一般，有着百转千回后的苦涩与甘甜？\n    树妖老板娘是听故事的人。而她自己也是在人生中淡然寻觅的人她的生命有子淼、九厥、敖炽、胖子、瘦子……\n    最终，他们将走向何方？'},
                {'title': '古文观止译注', 'id': 7367, 'comments': '项脊浮生'},
                {'title': '陈二狗的妖孽人生（续集）', 'id': 7031, 'comments': '关于作者有两种说法1、蚂蚁望月 2、烽火戏诸侯\n 不管谁写的，这本书的续写的非常合理。将《二狗》中烽火挖的坑的全部填上，并且十分合理。\n \n  \n“其爷如老龟，其父如瘦虎，其兄如饥鹰。”“你知道这句话的意思到底是什么吗？”陈浮生摇头，这句话他只是听王虎剩说过还真没往心里去，他一直以为那是王虎剩随口胡诌的。王玄策叹口气，“你们陈家当初只剩下四个男人。其爷如老龟，其父如瘦虎，其兄如饥鹰，就是玄武，白虎，朱雀。”“三元聚首出青龙。”\n其爷如老龟，其父如瘦虎，其兄如饥鹰，三元聚首出青龙。\n这便是这本书的二狗。'},
                {'title': '《陈二狗的妖孽人生》', 'id': 5675, 'comments': '衣衫褴褛的老人蹲坐在破败房子前的白桦木墩子上，喝一口自制的烧酒，抽一口极烈的青蛤蟆旱烟，眯起眼睛，望着即将落入长白山脉的夕阳，朝身旁一个约莫六七岁、正陪着一黑一白两头土狗玩耍的小孩子说道：“浮生，最让东北虎忌惮的畜生，不是皮糙肉厚的黑瞎子，也不是600斤的野猪王，而是上了山的守山犬。”\n\n\u3000\u3000许多年后，老人躺进了一座不起眼的坟包，那个没被大雪天刮烟炮冻死、没被张家寨村民戳脊梁骨白眼死的孩子终于走出大山，来到城市，像一条进了山的疯狗，咬过跪过低头过，所以荣耀。\n\n\u3000\u3000其爷如老龟，死于无名。其兄如饥鹰，搏击北方。其父如瘦虎，东临碣石。\n\n\u3000\u3000那绰号陈二狗的他，能否打拼出一世荣华？'},
                {'title': '浮生六记', 'id': 5394, 'comments': '并不能用有趣、精致、伤感简单概括这本小书。之所以入得经典行列，约是手边有此一册，便真如有一妙友相伴。\n本次出版选开明书店民国本为底本，考以《雁来红丛报》本、霜枫社民国本、林语堂英译本重新点校；并请张佳玮精心译述，作长文译记为读者导读。原文、译文并收一本。\n独家收录“沈复的一生”（年表）“沈复三十年游历图”，另附“光绪三年初版序”“潘麐生题记”“光绪三年初版跋”，便于读者朋友更好读懂这本书，从中获益。\n沈复，字三白，号梅逸。清乾隆二十八年（1763年）生于姑苏城南沧浪亭畔士族文人之家，十八岁娶舅女陈芸为妻。婚后夫妻俩举案齐眉、相爱甚笃，然命途多舛，常常事与愿违；幸而二人不落世俗，善苦中作乐，耳鬓厮磨二十三年，至芸积病身故，仍情深如旧。后，沈复离家漫游，著《浮生六记》六卷。成书后并未刊行出版，而在民间多有传抄，引以为珍。道光年间，由江南士人杨引传于街市书摊购得，转妹婿王韬于申报馆付梓出版。因其中以真言述真情，从不刻意造作，深为后世文人所推崇，流传至今，已成经典。其中《中山记历》《养生记道》两记，杨引传购得版本已佚。民国时期有称找到足本，并付梓出版，收录佚失两记，然实为时人拼凑杜撰。后常有传言佚记真本现身，或有相关、或片段，但至今仍无被证实可靠完整的，故本版只收底本所录《闺房记乐》《闲情记趣》《坎坷记愁》《浪游记快》四记。\n俞平伯：“《浮生六记》俨如一块纯美的水晶，只见明莹，不见衬露明莹的颜色；只见精微，不见制作精微的痕迹。然而我自信这种说法不至于是溢美。想读这书的，必有能辨别的罢。”\n林语堂：“我相信淳朴恬适自甘的生活——如芸所说“布衣菜饭，可乐终身”的生活，是宇宙间最美丽的东西。在我翻阅重读这本小册之时，每每不期然而然想到这安乐的问题——读了沈复的书每使我感到这安乐的奥妙，远超乎尘俗之压迫与人身之痛苦。”'},
                {'title': '算来一梦浮生', 'id': 4690, 'comments': '江南的山山水水，春光秋色里，他用最真实的自己，抒写了一段最感人至深、亦是最怅然的故事。\n他是文人、是君主、也是降君。后人的纸笔中总有他俊朗洒脱的身影，也有他坎坷波折的一生；有他的疏狂，亦有他的忧伤和绝望……\n但他总还是他吧。在历史的某一个角落里，用他特有的光晕，驱开四周的黑暗，让我们望到了昏黄月光下，那个“待踏马蹄清夜月”的他，那个“无言独上西楼”的他……\n算来一梦浮生，他的人生早已走完，但是千百年来，我们却还有无数的人，流连在他不一般的人生故事中……'},
                {'title': '小麦的小人书', 'id': 5305, 'comments': '《小麦的小人书》是一本既有趣味，又有品质的书。小人书，就是上世纪八十年代中期以前风行中国大地几十年，为广大群众喜闻乐见，雅俗共赏的连环画。作者以连环画为支点，选择不同的剖面切入，深致浅出，融艺术鉴赏、人生体悟和情感想象于一炉。作者文笔独特，既典雅蕴藉、又俏皮灵动，亦庄亦谐，张弛有道，显示出深厚的文字功力。这个总题为《浮生旧梦说连环》的系列散文2008-2009年陆续在《天涯》、《文学自由谈》、《美文》、《人民文学》、《读库》等刊物以集中或连载形式发表，备受关注，好评如潮。文章分为六辑：“山乡”、“打仗”、“贺家班”、“好姻缘”、“古装”、“隋唐”，并配有相应的连环画，文图相得益彰。集结成一《小麦的小人书》，不同读者的阅读期待、审美需求、怀旧心理、收藏品味都将得到满足，它是一本不可多得的好书。'},
                {'title': '浮生六记', 'id': 5394, 'comments': '并不能用有趣、精致、伤感简单概括这本小书。之所以入得经典行列，约是手边有此一册，便真如有一妙友相伴。\n本次出版选开明书店民国本为底本，考以《雁来红丛报》本、霜枫社民国本、林语堂英译本重新点校；并请张佳玮精心译述，作长文译记为读者导读。原文、译文并收一本。\n独家收录“沈复的一生”（年表）“沈复三十年游历图”，另附“光绪三年初版序”“潘麐生题记”“光绪三年初版跋”，便于读者朋友更好读懂这本书，从中获益。\n沈复，字三白，号梅逸。清乾隆二十八年（1763年）生于姑苏城南沧浪亭畔士族文人之家，十八岁娶舅女陈芸为妻。婚后夫妻俩举案齐眉、相爱甚笃，然命途多舛，常常事与愿违；幸而二人不落世俗，善苦中作乐，耳鬓厮磨二十三年，至芸积病身故，仍情深如旧。后，沈复离家漫游，著《浮生六记》六卷。成书后并未刊行出版，而在民间多有传抄，引以为珍。道光年间，由江南士人杨引传于街市书摊购得，转妹婿王韬于申报馆付梓出版。因其中以真言述真情，从不刻意造作，深为后世文人所推崇，流传至今，已成经典。其中《中山记历》《养生记道》两记，杨引传购得版本已佚。民国时期有称找到足本，并付梓出版，收录佚失两记，然实为时人拼凑杜撰。后常有传言佚记真本现身，或有相关、或片段，但至今仍无被证实可靠完整的，故本版只收底本所录《闺房记乐》《闲情记趣》《坎坷记愁》《浪游记快》四记。\n俞平伯：“《浮生六记》俨如一块纯美的水晶，只见明莹，不见衬露明莹的颜色；只见精微，不见制作精微的痕迹。然而我自信这种说法不至于是溢美。想读这书的，必有能辨别的罢。”\n林语堂：“我相信淳朴恬适自甘的生活——如芸所说“布衣菜饭，可乐终身”的生活，是宇宙间最美丽的东西。在我翻阅重读这本小册之时，每每不期然而然想到这安乐的问题——读了沈复的书每使我感到这安乐的奥妙，远超乎尘俗之压迫与人身之痛苦。”'},
                {'title': '算来一梦浮生', 'id': 4690, 'comments': '江南的山山水水，春光秋色里，他用最真实的自己，抒写了一段最感人至深、亦是最怅然的故事。\n他是文人、是君主、也是降君。后人的纸笔中总有他俊朗洒脱的身影，也有他坎坷波折的一生；有他的疏狂，亦有他的忧伤和绝望……\n但他总还是他吧。在历史的某一个角落里，用他特有的光晕，驱开四周的黑暗，让我们望到了昏黄月光下，那个“待踏马蹄清夜月”的他，那个“无言独上西楼”的他……\n算来一梦浮生，他的人生早已走完，但是千百年来，我们却还有无数的人，流连在他不一般的人生故事中……'},
                {'title': '小麦的小人书', 'id': 5305, 'comments': '《小麦的小人书》是一本既有趣味，又有品质的书。小人书，就是上世纪八十年代中期以前风行中国大地几十年，为广大群众喜闻乐见，雅俗共赏的连环画。作者以连环画为支点，选择不同的剖面切入，深致浅出，融艺术鉴赏、人生体悟和情感想象于一炉。作者文笔独特，既典雅蕴藉、又俏皮灵动，亦庄亦谐，张弛有道，显示出深厚的文字功力。这个总题为《浮生旧梦说连环》的系列散文2008-2009年陆续在《天涯》、《文学自由谈》、《美文》、《人民文学》、《读库》等刊物以集中或连载形式发表，备受关注，好评如潮。文章分为六辑：“山乡”、“打仗”、“贺家班”、“好姻缘”、“古装”、“隋唐”，并配有相应的连环画，文图相得益彰。集结成一《小麦的小人书》，不同读者的阅读期待、审美需求、怀旧心理、收藏品味都将得到满足，它是一本不可多得的好书。'},
                {'title': '乡关何处', 'id': 3791, 'comments': '《乡关何处:故乡•故人•故事》内容简介：感知故乡、故人、故事中的深沉情感。《乡关何处:故乡•故人•故事》所收录的文章中，母亲历尽人生苦难68岁失踪于长江（江上的母亲）；外婆出身高贵，慈悲温暖，却一生遭遇悲惨（坟灯）；大伯少年英姿勃发才华横溢投身革命，爱情也随之而来，但谁知阴差阳错，最终凄凉落寞孤独走完一生（大伯的革命与爱情）……在《乡关何处》中，这等亲朋好友，仿佛就这么站在你的面前，将他们的故事幽幽道来。在野夫的笔下，除了能读到他们个人或悲惨或传奇的经历，还能看到这几十年来大背景下的变革与变迁。《乡关何处》是作者野夫泣血的挽歌，至情至亲至哀，长久积累下的压抑的悲恸比爆发更有力量。\n野夫如此解释《乡关何处:故乡•故人•故事》的乡愁：许多年来，我问过无数人的故乡何在，大多都不知所云。故乡于很多人来说，是必须要扔掉的裹脚布；仿佛不遗忘，他们便难以飞得更高走得更远。而我，若干年来却像一个遗老，总是沉浸在往事的泥淖中，在诗酒猖狂之余，常常失魂落魄地站成了一段乡愁。\n思享家系列丛书：\n半生为人\n问道者\n旧山河\n价值的理由   海报：'},
            ],
            'total': 9
        },
    })
}
</script>

<style>
.book-title {
    display: block;
    /*height: 1em;*/
    overflow-y: hidden;
    display: -webkit-box;
    -webkit-line-clamp: 1;
    -webkit-box-orient: vertical;
    text-overflow: clip;
    text-align: left;
    font-weight: bold;
}
.book-comments {
    /*text-indent: 2em;*/
    overflow: hidden;
    display: -webkit-box;
    -webkit-line-clamp: 2;
    -webkit-box-orient: vertical;
    text-overflow: clip;
    margin-top: 6px;
    text-align: left;
}
.book-card {
    padding: 6px;
}
.page-title {
    font-weight: bold;
    text-align: left;
}
.new-legend {
    margin-top: 30px;
    margin-bottom: 20px;
}

</style>
